Revit 2024 API
IFCExtrusionCreationData.PossibleExtrusionAxes Property
 The axes to try when generating the properties of the extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCExtrusionAxes PossibleExtrusionAxes { get; set; }
Visual Basic
Public Property PossibleExtrusionAxes As IFCExtrusionAxes
	Get
	Set
Visual C++
public:
property IFCExtrusionAxes PossibleExtrusionAxes {
	IFCExtrusionAxes get ();
	void set (IFCExtrusionAxes value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace